import { Component, OnInit } from '@angular/core';
import {MqttService} from '../../services/mqtt.service';

@Component({
  selector: 'app-bottom-station',
  templateUrl: './bottom-station.component.html',
  styleUrls: ['./bottom-station.component.scss']
})
export class BottomStationComponent implements OnInit {

  dataSource = {
    下站紧急停车: ['控制台紧急停车', '出站抱索器形位异常', '出站口紧急停车', '进站侧脱开后检测异常', '进站侧拉绳开关',
      '进站口紧急停车', '出站侧脱开后检测异常', '出站侧拉绳开关'],
    下站报警信号: ['与中间站方向选择异常', '抱索力低', '区域开关1检测异常', '低速轮异常', '进站侧开关门开关异常' ,
      '区域开关15检测异常', '高速轮异常', '出站侧开关门开关异常'],
    下站正常停车: ['下站操作台正常停车'],
    下站报警不停车: ['区域开关1异常', '区域开关15异常', '进站侧开关门开关异常', '出站侧开关门开关异常', '与中间站方向选择异常',
      '抱索力低', '低速轮异常', '高速轮异常'],
    下站安全停车: ['控制台按钮停车', '进站抱索器形位异常', '进站钢绳垂直位1异常', '进站钢绳垂直位2异常', '进站侧水平绳位异常',
      '反向出站抱索力异常', '进站挂结前异常', '反向运行侧力起信号异常', '反向运行侧力止信号异常', '计数脉冲异常',
      '反向出站未关门', '运行中道岔异动', '防断轴检测异常', '防抱死检测异常', '站口安全停车',
      '接地棒位置异常', '出站钢绳垂直位1异常', '出站钢绳垂直位2异常', '出站侧水平绳位异常', '正向出站抱索力异常',
      '出站侧挂结前异常', '正向运行测力起信号异常', '正向运行测力止信号异常', '出站侧钢丝绳+10%检测异常', '出站侧钢丝绳-10%检测异常',
      '出站限制门异常', '正向出站未关门', '反向运行检修道岔处于入库位', '区域1检测异常', '区域2检测异常',
      '区域3检测异常', '区域4检测异常', '区域5检测异常', '区域6检测异常', '区域7检测异常',
      '区域8检测异常', '区域9检测异常', '区域10检测异常', '区域11检测异常', '区域12检测异常',
      '区域13检测异常', '区域14检测异常', '相邻区域有车', '正向运行道岔位置异常', '反向运行道岔位置异常',
      '张紧压力超限+10%', '张紧压力超限-10%', '张紧传感器异常', '升降平台位置异常',  '张紧小车超限位']
  };
  titleArr = ['下站紧急停车', '下站报警信号', '下站正常停车', '下站报警不停车', '下站安全停车'];
  constructor(public mqttService: MqttService) { }

  ngOnInit() {
  }

}
