import { Component, OnInit } from '@angular/core';
import {MqttService} from '../../services/mqtt.service';

@Component({
  selector: 'app-mid-station',
  templateUrl: './mid-station.component.html',
  styleUrls: ['./mid-station.component.scss']
})
export class MidStationComponent implements OnInit {

  dataSource = {
    中间站紧急停车: ['控制台紧急停车', '手动泄压急停', '按钮盒急停', '主回路异常', '整流电源异常', '运行中主辅机异动', '主机和从机电流差值过大', '联动中中间站与上站通讯异常',
      '上行进站侧脱开后', '上行进站侧拉绳开关', '上行进站口紧急停车', '上行出站侧脱开后', '上行出站侧拉绳开关', '上行出站口紧急停车', '上行出战抱索器形位异常',
    '下行进站侧脱开后', '下行进站侧拉绳开关', '下行进站口紧急停车', '下行出站侧脱开后', '下行出站侧拉绳开关', '下行出站口紧急停车', '下行出战抱索器形位异常'],
    中间站正常停车: ['总旁路时间到', '限速保护', '操作台正常停车', '驱动松闸5秒未运行停车'],
    中间站报警不停车: ['上行区域开关1异常', '上行区域开关13异常', '上行进站侧开关门开关异常', '上行出站侧开关门开关异常', '上行辅机运行时减速机流量异常',
      '上行与上站方向选择异常', '上行抱索力低', '上行低速轮异常', '上行高速轮异常', '下行区域开关1异常', '下行区域开关14异常', '下行进站侧开关门开关异常', '下行出站侧开关门开关异常', '下行抱索力低',
      '下行低速轮异常', '下行高速轮异常', '下行与下站通讯异常'],
    中间站安全停车: ['减速机输出轴温度过高80℃', '减速机润滑流量异常', '控制台按钮停车', '高速闸动作异常', '低速闸动作异常',
      '单闸测试异常', '开车后溜车', '主辅连锁异常', '运行中模式转换', '电机绕组过热停车',
      '上段支架脱索', '下段支架脱索', '发车进站保护', '速度异常', '旁路或故障超限速',
      '超速10%', '张紧压力超限+10%', '张紧压力超限-10%', '张紧传感器异常', '张紧小车超限位',
      '中站驱动防断轴异常', '中站驱动防抱死异常', '中站迂回防断轴异常', '中站迂回防抱死异常',
      '上行侧发车进站保护', '下行侧发车进站保护'],
    '上行/下行异常': ['进站钢绳垂直位1异常', '进站钢绳垂直位2异常', '出站钢绳垂直位1异常', '出站钢绳垂直位2异常', '车厢防撞系统异常',
      '出站限制门异常', '运行中道岔异动', '计数脉冲异常', '道岔异常', '站口安全停车',
      '进站抱索器形位异常', '平台位置异常', '进站侧水平绳位异常', '出站侧水平绳位异常', '正向出站未关门',
      '反向出站未关门', '出站侧钢丝绳+10%', '出站侧钢丝绳-10%', '出站侧挂接前异常', '进站挂接前异常',
      '正向抱索力异常', '反向抱索力异常', '接地异常', '正向运行侧力起信号异常', '正向运行侧力止信号异常',
      '反向运行侧力起信号异常', '反向运行侧力止信号异常', '区域1异常', '区域2异常', '区域3异常',
      '区域4异常', '区域5异常', '区域6异常', '区域7异常', '区域8异常',
      '区域9异常', '区域10异常', '区域11异常', '区域12异常', '区域13异常']
  };
  titleArr = ['中间站紧急停车', '中间站紧急停车', '中间站正常停车', '中间站报警不停车', '中间站安全停车'];
  constructor(public mqttService: MqttService) { }

  ngOnInit() {
  }


}
